# CRUD Operation with SQLite3

In [27]:
import os    
import sqlite3

## Helping Functions

In [28]:
def execute_sql(dbname, sql):
    # Connect to database
    try:
        connection = sqlite3.connect(dbname)
        # Create a cursor object to iterate the database
        cursor = connection.cursor()
        cursor.execute(sql)
        # Commit the transaction
        connection.commit()
        print(f"{cursor.rowcount}")
    #Catch exception
    except sqlite3.IntegrityError as e:
        print(f"Integrity error: {e}")
    except sqlite3.Error as e:
        print(f"An DB error occurred: {e}")
    except Exception as ex:
        print(f"An Exception has occurred: {ex}")
    finally:
        cursor.close()
        connection.close()

def execute_many(dbname, sql, list_param):
    # Connect to database
    try:
        connection = sqlite3.connect(dbname)
        # Create a cursor object to iterate the database
        cursor = connection.cursor()
        cursor.executemany(sql, list_param)
        # Commit the transaction
        connection.commit()
        print(f"{cursor.rowcount}")
    #Catch exception
    except sqlite3.IntegrityError as e:
        print(f"Integrity error: {e}")
    except sqlite3.Error as e:
        print(f"An DB error occurred: {e}")
    except Exception as e:
        print(f"An Exception has occurred: {e}")
    finally:
        cursor.close()
        connection.close()

def execute_fetchall(dbname, sql):
    try:
        connection = sqlite3.connect(dbname)
        cursor = connection.cursor()
        cursor.execute(sql)
        rows = cursor.fetchall()
        
        for row in rows:
            print(row)
    #Catch exception
    except sqlite3.IntegrityError as e:
        print(f"Integrity error: {e}")
    except sqlite3.Error as e:
        print(f"An DB error occurred: {e}")
    except Exception as ex:
        print(f"An Exception has occurred: {ex}")
    finally:
        cursor.close()
        connection.close()

## Create DB and Table (If not already exists)

In [29]:
db = 'mycompany.db'
sql = '''
    CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    email TEXT NOT NULL UNIQUE,
    phone TEXT NOT NULL UNIQUE,
    address TEXT NOT NULL,
    department TEXT,
    salary REAL
    )
'''

execute_sql(db, sql)

-1

## Insert Data

In [30]:
## Insert the data in SQLlite table

# List of employee records to insert
employees = [
    ('Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1', None, None),
    ('Employee 2', 'emp2@mycompany.com', '+923001000002', 'Employee 2 House#, Street 2, District 2, City 2, Country 1, Zip/Postal 2', 'MARKETING', 12000),
    ('Employee 3', 'emp3@mycompany.com', '+923001000003', 'Employee 3 House#, Street 3, District 3, City 3, Country 1, Zip/Postal 3', 'SALES', 10000),
    ('Employee 4', 'emp4@mycompany.com', '+923001000004', 'Employee 4 House#, Street 4, District 4, City 4, Country 1, Zip/Postal 4', 'FINANCE', 14000)
]

sql = '''
    INSERT INTO employees (name, email, phone, address, department, salary)
    VALUES (?, ?, ?, ?, ?, ?)
'''

execute_many(db, sql, employees)

4

## Query Data

In [31]:
sql = '''
    SELECT * FROM employees
'''

execute_fetchall(db, sql)

(1, 'Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1', None, None)
(2, 'Employee 2', 'emp2@mycompany.com', '+923001000002', 'Employee 2 House#, Street 2, District 2, City 2, Country 1, Zip/Postal 2', 'MARKETING', 12000.0)
(3, 'Employee 3', 'emp3@mycompany.com', '+923001000003', 'Employee 3 House#, Street 3, District 3, City 3, Country 1, Zip/Postal 3', 'SALES', 10000.0)
(4, 'Employee 4', 'emp4@mycompany.com', '+923001000004', 'Employee 4 House#, Street 4, District 4, City 4, Country 1, Zip/Postal 4', 'FINANCE', 14000.0)

## Update Data

In [32]:
salary = 10000

sql = f'''
    UPDATE employees
    SET salary = {salary * 1.1}, department = 'HR'
    WHERE id = 1
'''

execute_sql(db, sql)

1

In [33]:
sql = '''
    SELECT * FROM employees Where id = 1
'''

execute_fetchall(db, sql)

(1, 'Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1', 'HR', 11000.0)

## Delete Data

In [34]:
sql = '''
    INSERT INTO employees (name, email, phone, address, department, salary)
    VALUES ('Emp 5', 'emp5@mycompany.com', '+923001000005', 'Emp 5 House#, Street 5, District 5, City 5, Country 1, Zip/Postal 5', 'DEVELOPMENT', 10400)
'''

execute_sql(db, sql)

1

In [35]:
sql = '''
    SELECT * FROM employees
'''

execute_fetchall(db, sql)

(1, 'Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1', 'HR', 11000.0)
(2, 'Employee 2', 'emp2@mycompany.com', '+923001000002', 'Employee 2 House#, Street 2, District 2, City 2, Country 1, Zip/Postal 2', 'MARKETING', 12000.0)
(3, 'Employee 3', 'emp3@mycompany.com', '+923001000003', 'Employee 3 House#, Street 3, District 3, City 3, Country 1, Zip/Postal 3', 'SALES', 10000.0)
(4, 'Employee 4', 'emp4@mycompany.com', '+923001000004', 'Employee 4 House#, Street 4, District 4, City 4, Country 1, Zip/Postal 4', 'FINANCE', 14000.0)
(5, 'Emp 5', 'emp5@mycompany.com', '+923001000005', 'Emp 5 House#, Street 5, District 5, City 5, Country 1, Zip/Postal 5', 'DEVELOPMENT', 10400.0)

In [36]:
sql = '''
    DELETE FROM employees Where id = 5
'''

execute_sql(db, sql)

1

In [37]:
sql = '''
    SELECT * FROM employees
'''

execute_fetchall(db, sql)

(1, 'Employee 1', 'emp1@mycompany.com', '+923001000001', 'Employee 1 House#, Street 1, District 1, City 1, Country 1, Zip/Postal 1', 'HR', 11000.0)
(2, 'Employee 2', 'emp2@mycompany.com', '+923001000002', 'Employee 2 House#, Street 2, District 2, City 2, Country 1, Zip/Postal 2', 'MARKETING', 12000.0)
(3, 'Employee 3', 'emp3@mycompany.com', '+923001000003', 'Employee 3 House#, Street 3, District 3, City 3, Country 1, Zip/Postal 3', 'SALES', 10000.0)
(4, 'Employee 4', 'emp4@mycompany.com', '+923001000004', 'Employee 4 House#, Street 4, District 4, City 4, Country 1, Zip/Postal 4', 'FINANCE', 14000.0)

## Drop The Table

In [38]:
# Conditionally so that you don't delete it mistakenly
delete_tbl = input(f"Type 'Yes'|'Y' to confirm the deletion of Table employees: ")

if delete_tbl.strip().lower()  in ['y', 'yes']:
    
    execute_sql(db, 'DROP TABLE employees')
    print(f"employees table deleted successfully.")
else:
    print(f"You choose to keep the employees table")

You choose to keep the employees table

## Remove Database

In [39]:
# Conditionally so that you don't delete it mistakenly
delete_db = input(f"Type 'Yes'|'Y' to confirm the deletion of DB {db}: ")

if delete_db.strip().lower() in ['y', 'yes']:
    # Check if the database file exists before deleting
    if os.path.exists(db):
        os.remove(db)
        print(f"Database '{db}' deleted successfully.")
    else:
        print(f"Database '{db}' does not exist.")
else:
    print(f"You choose to keep the {db} database.")

You choose to keep the mycompany.db database.